---
title: 计算机网络静态路由的配置实验
date: 2023-11-21 15:57:42
tags: 计算机网络
---

# 实验八、静态路由的配置

### 一、实验目的

1．掌握路由器的主要功能。

2．掌握静态路由的配置方法。

### 二、实验内容

1．安装CISCO模拟器；

2．画出网络拓扑图；

3．进行静态路由的配置；

4．测试网络的通信效果。

### 三、实验原理

在不同网络之间进行通信时，需要用到路由器这种设备。路由器的两个主要功能就是路由选择和数据转发。路由选择的方法有很多，最简单的一种就是静态路由，通过对路由器进行路径规定，使得数据可以跨不同网段进行通信。

一般来说，可通过五种方式来设置路由器：

1．控制台（Console口）接终端，或运行终端仿真软件的微机；

2．辅助端口（AUX口）接MODEM，通过电话线与远方的终端或运行终端仿真软件的微机相连；

3．通过Ethernet上的简单文件传输协议（TFTP）服务器；

4．通过Ethernet上的TELNET程序；

5．通过Ethernet上的简单网络管理协议（SNMP）,路由器可通过运行网络管理软件的工作站配置。

但路由器的第一次设置必须通过第一种方式进行,此时终端的硬件设置如下:

波特率 ：9600

数据位 ：8

停止位 ：1

奇偶校验: 无

### 四、实验步骤

为简化步骤，我们可以直接在路由器上写命令。

![image-20231121162110199](../images/image-20231121162110199.png)

```bash
Router0：

Router>

Router>enable   //进入特权模式

Router#conf t   //进入全局配置模式

Enter configuration commands, one per line. End with CNTL/Z.

Router(config)#int f0/0   //即interface fastEthernet 0/0进入路由器接口配置模式

Router(config-if)#ip address 10.1.1.1 255.255.255.0 //配置路由器管理接口的IP地址

Router(config-if)#no shutdown  //开启路由器的fastEthernet 0/0接口。注意，给端口配置IP的命令也可以在图形界面上实现，配完别忘记打开端口

Router(config-if)#exit

Router(config)#ip route 192.168.1.0 255.255.255.0 10.1.1.2 //先不写这句话，在Router0上ping  192.168.1.1，是否可以ping通？写完之后再试一试

Router(config)#end
```

```bash
Router1：

Router>enable

Router#conf t

Router#conf t

Router(config)#no ip domain-look //关闭域名解析，原因假如你在CLI下输入了1个Cisco设备不能识别的命令,它会默认通过DNS来进行解析(它认为是主机名).这个不好的地方是要花费额外的时间等待DNS解析完.可以在全局配置模式下使用no ip domain-look命令关闭它

Router(config)#int f0/0

Router(config-if)#ip address 10.1.1.2 255.255.255.0

Router(config-if)#no shutdown

Router(config-if)#

Router(config-if)#exit

Router(config)#int f0/1

Router(config-if)#ip address 192.168.1.1 255.255.255.0

Router(config-if)#no shut

Router(config-if)#exit
```

```bash
Router2：

Router>enable 

Router#conf t

Router(config)#int f0/1

Router(config-if)#ip address 192.168.1.2 255.255.255.0

Router(config-if)#no shut

Router(config-if)#

Router(config-if)#exit

Router(config)#ip route 10.1.1.0 255.255.255.0 192.168.1.1 //这句命令先不要写，实验一下在Router0上ping其它IP的结果，是不是除了192.168.1.2外都可以ping通？写完这句话后再试一下是不是都可以了？原因是什么？在实验结果1中回答。

Router(config)#end
```

### 五、实验结果

1、在 Router2设置路由表之前之后，用Router0分别和其他的两台路由器进行测试，看一下网络是否联通，并思考为什么会出现这种情况。

**Route0只能ping通直连的10.1.1.2，而不能ping通不直连的192.168.1.1和192.168.1.12。因为路由表中没有存储前往ip地址的下一跳的地址。**

**但是如果单单配置单向的也是不能ping通的，是因为ping的包需要返回，二没有配置返回的路径。**

2、用Router1分别和其他的两台路由器进行测试，看一下网络是否联通，并思考为什么会出现这种情况。

**Route1是相通的，因为端口直连要ping的IP地址。**

3、用Router2分别和其他的两台路由器进行测试，看一下网络是否联通，并思考为什么会出现这种情况。

**Router2是可以ping通的，因为已经配置好了路由表的地址的下一跳要经过哪里。**

注意：直接在路由器的CLI中ping即可：

```bash
Router#ping 192.168.1.1

Type escape sequence to abort.

Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:

!!!!!

Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/1 ms

//这就表示通了

Router#ping 192.168.1.2

Type escape sequence to abort.

Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:

.....

Success rate is 0 percent (0/5)

//这就是没有通
```

### 六、实验原理

在思科模拟器中，使用的是Cisco的设备模拟器，例如Packet Tracer或者GNS3。这些模拟器提供了类似于实际Cisco路由器和交换机的环境，但命令和配置可能略有不同。在Cisco设备上，配置路由表的命令通常是`ip route`，但具体的语法和选项可能会有些许差异。

以下是在Cisco设备上的一些基本示例：

- **显示路由表信息：**

  ```bash
  show ip route
  ```

- **添加静态路由：**

  ```bash
  ip route [目标网络] [子网掩码] [下一跳地址或出口接口]
  ```

- **删除路由：**

  ```bash
  no ip route [目标网络] [子网掩码] [下一跳地址或出口接口]
  ```

- **默认路由设置：**

  ```bash
  ip route 0.0.0.0 0.0.0.0 [默认网关]
  ```

请注意，具体的命令可能因设备型号和操作系统版本而异。在使用模拟器时，建议查阅相应设备的文档以获取准确的命令和配置信息。

添加route之前

Route0去ping192.168.1.1

![image-20231121160802070](../images/image-20231121160802070.png)

ping自身是可以的

![image-20231121160906323](../images/image-20231121160906323.png)

ping直接相连的路由端口是可以ping通的

![image-20231121160951662](../images/image-20231121160951662.png)

ping192.168.1.2是不可以ping通的

![image-20231121164730577](../images/image-20231121164730577.png)



当添加了命令后可以ping通了192.168.1.1，但是192.168.1.2仍然不可以

![image-20231121161149284](../images/image-20231121161149284.png)

当我没有配置route2的route时，ping route0是不可以通信的

![image-20231121161416077](../images/image-20231121161416077.png)

当配置之后route2是可以和route0的端口通信的

![image-20231121164824576](../images/image-20231121164824576.png)
